app/controllers/users_controller.rb

    def update
        user = User.find_by(name: params[:id].parameterize)
        if user
            user.update(name: user_params[:name].parameterize, player: user_params[:player], inventory: user_params[:inventory])
---
UPDATE "users" SET "player" = ?, "inventory" = ?, "updated_at" = ? WHERE "users"."id" = ?