app/controllers/users_controller.rb

    def show
        user = User.find_by(name: params[:id].parameterize)
---
SELECT "users".* FROM "users" WHERE "users"."name" = ? LIMIT ?  [["name", "squidbilly"], ["LIMIT", 1]]

    def create
        user = User.new(name: user_params[:name])
        save = Gamesave.new(user_params[:gamesave])
        user.gamesaves.push(save)
        user.name = user.name.parameterize
        if user.save
---
INSERT INTO "gamesaves" ("user_id", "created_at", "updated_at") VALUES (?, ?, ?)  [["user_id", 2], ["created_at", "2021-03-04 01:45:21.393632"], ["updated_at", "2021-03-04 01:45:21.393632"]]
INSERT INTO "users" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "nathan"], ["created_at", "2021-03-04 01:13:42.659401"], ["updated_at", "2021-03-04 01:13:42.659401"]]
INSERT INTO "users" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "johndeguide"], ["created_at", "2021-04-02 18:33:54.090576"], ["updated_at", "2021-04-02 18:33:54.090576"]]

    def update
        user = User.find_by(name: user_params[:name].parameterize)
        if user
            #gamesave = Gamesave.new(user_params[:gamesave])
            #user.gamesaves.push(gamesave)
            #user.save
            user.gamesaves.create(user_params)
---
SELECT "users".* FROM "users" WHERE "users"."name" = ? LIMIT ?  [["name", "name"], ["LIMIT", 1]]
INSERT INTO "gamesaves" ("user_id", "player", "inventory", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"